emacs-3-years.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacs 三年</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jason Tian" />
<link rel="stylesheet" type="text/css" href="./css/worg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">Emacs 三年</h1>
<p>
潜心修炼 Emacs 和 Emacs Lisp 已经 3 年多，我经常会感觉自己一直在原地打转，并为此困惑不已。
</p>

<p>
直到今天，源于一个我从 2021 年开始启用的有道词典在线插件，今天发现它开始出服务器错误提示了。对此我其实是一点都不意外，因为我现在已经坚信「简单化」和「本地化」才是王道。何不借此机会，干脆写一个 function 直接调用我本地的 GoldenDict 呢？直觉告诉我，这应该不难。
</p>

<p>
而这“直觉”属实让我兴奋和惊喜！要知道 1 年前这种想法我是想都不敢想的。
</p>

<p>
于是，大概 10 分钟后，我就有了<a href="https://github.com/jsntn/emacs.d/blob/2faac38bfb664eacfc582fb8cbf9f30c72102662/lisp/init-dict.el#L7L29">这样</a>的一段代码。
</p>

<p>
至此，我终于感到自己并没有在原地打转。
</p>

<p>
因为山始终在那里，可它的影像于我确已清晰。
</p>

<p>
&#x2013;
</p>

<p>
I have been devoted to mastering Emacs and Emacs Lisp for over 3 years now, but
I often feel like I'm spinning my wheels and it confuses me.
</p>

<p>
Until today, when I encountered a server error message from the Youdao
Dictionary online plugin that I started using in 2021. I wasn't surprised at all
because now I firmly believe that "simplicity" and "localization" are the way to
go. So why not take this opportunity and write a function to directly call my
local GoldenDict? My intuition tells me that it shouldn't be difficult.
</p>

<p>
And this intuition truly excites and surprises me! You see, a year ago, I
wouldn't have dared to entertain such an idea.
</p>

<p>
So, about 10 minutes later, I had <a href="https://github.com/jsntn/emacs.d/blob/2faac38bfb664eacfc582fb8cbf9f30c72102662/lisp/init-dict.el#L7L29">this</a> piece of code.
</p>

<p>
And now, I finally feel like I'm not spinning my wheels anymore.
</p>

<p>
Because the mountain is always there, but its image has become clear to me.
</p>
</div>
<div id="postamble" class="status">
<hr />
<p><a href="//jsntn.com">Jason Tian</a><br /><span class="timestamp-wrapper"><span class="timestamp">[2023-07-27 Thu 17:56]</span></span></p>
</div>
</body>
</html>
